IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI0_TX0_CONTROLSS_FSI0_TX0.xml
	<register id="CONTROLSS_FSI0_TX0_TX_FRAME_TAG_UDATA" acronym="CONTROLSS_FSI0_TX0_TX_FRAME_TAG_UDATA" offset="0xE" width="16" description="">
		<bitfield id="USER_DATA" width="8" begin="15" end="8" resetval="0x0" description="User Data bits This is a user-defined value that will be loaded into the the user data phase of the frame. This 8-bit value can be used by the receiver for any application need. This value will not impact any hardware behavior." range="15 - 8" rwaccess="RW"/> 
		<bitfield id="FRAME_TAG" width="4" begin="3" end="0" resetval="0x0" description="This will be used only for software initiated transmissions. Frame tag bits This is a user-defined value that will be loaded into the frame tag phase of the next transmission. The receiver may use the frame tag for any application need. This value will not impact any hardware behavior  For external triggers do not use this register. Use the TX_PING_TAG register instead." range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_BUF_PTR_LOAD" acronym="CONTROLSS_FSI0_TX0_TX_BUF_PTR_LOAD" offset="0x10" width="16" description="">
		<bitfield id="BUF_PTR_LOAD" width="4" begin="3" end="0" resetval="0x0" description="Buffer Pointer Load bits These bits are used to force the transmit buffer pointer to a desired index within the transmit buffer. The next transmission will begin picking data from this index and increment appropriately. This value will be reflected in TX_BUF_PTR_STS only after a minimum 3 SYSCLK cycles + 3 TXCLK cycles.  This value should not be written while there is an active transmission as it may corrupt the ongoing frame or other undefined behavior." range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_BUF_PTR_STS" acronym="CONTROLSS_FSI0_TX0_TX_BUF_PTR_STS" offset="0x12" width="16" description="">
		<bitfield id="CURR_WORD_CNT" width="5" begin="12" end="8" resetval="0x0" description="Words Remaining in the transmit buffer  This value indicates the number of words present in the data buffer which have not yet been transmitted. This value is only valid when there is no active transmission.  Note: This value will not be valid if there is a buffer overrun or underrun condition." range="12 - 8" rwaccess="RO"/> 
		<bitfield id="CURR_BUF_PTR" width="4" begin="3" end="0" resetval="0x0" description="Current Buffer Pointer Index This bitfield will show the current index of the buffer pointer. This value is only valid when there is no active transmission." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_PING_CTRL_ALT1_" acronym="CONTROLSS_FSI0_TX0_TX_PING_CTRL_ALT1_" offset="0x14" width="16" description="">
		<bitfield id="EXT_TRIG_SEL" width="6" begin="8" end="3" resetval="0x0" description="External Trigger Select bits This bitfield will select one of the 64 external trigger inputs to as the source to generate a ping frame. A ping frame will only be generated if the EXT_TRIG_EN bit is set.  0h (R/W) = Trigger 1 will be used to generate a ping frame. 1h (R/W) = Trigger 2 will be used to generate a ping frame. .. 3Fh (R/W) = Trigger 64 will be used to generate a ping frame." range="8 - 3" rwaccess="RW"/> 
		<bitfield id="EXT_TRIG_EN" width="1" begin="2" end="2" resetval="0x0" description="External Trigger Enable bit This bit will allow the external trigger logic to generate a ping frame.  0h (R/W) = External triggers will not be used to generate ping frames. 1h (R/W) = The selected external trigger (selected by EXT_TRIG_SEL bits) will be able to generate a ping frame. The ping timer will be ignored if this bit is set." range="2" rwaccess="RW"/> 
		<bitfield id="TIMER_EN" width="1" begin="1" end="1" resetval="0x0" description="Ping Timer Enable bit This bit will enable the ping timer for generating periodic ping frames.  0h (R/W) = The ping timer is disabled and will not generate ping frames. 1h (R/W) = The ping timer is enabled and can be used to generate ping frames.Once the timer count reaches the value set by the TX_PING_TO_REF register, it will initiate a ping frame transmission.   Note: If the ping timer is used, EXT_TRIG_EN should not be set as it will override this function." range="1" rwaccess="RW"/> 
		<bitfield id="CNT_RST" width="1" begin="0" end="0" resetval="0x0" description="Ping Counter Reset bit Writing a 1 to this bit will reset the ping counter to 0. The counter will stay in reset as long as this bit is set to 1. This bit needs to be cleared to 0 to use the counter.  0h (R/W) = Clear the CNT_RST. 1h (R/W) = The ping counter will be reset to 0." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_PING_TAG" acronym="CONTROLSS_FSI0_TX0_TX_PING_TAG" offset="0x16" width="16" description="">
		<bitfield id="TAG" width="4" begin="3" end="0" resetval="0x0" description="Ping Frame Tag This field contains a 4-bit tag which will be sent in any ping frame that is initiated by an external trigger or the ping timer. This field is user-defined and can be set based on the application requirement. If a ping frame is generated manually, the transmitted tag will be from TX_FRAME_TAG_UDATA.FRAME_TAG, not this value." range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_PING_TO_REF" acronym="CONTROLSS_FSI0_TX0_TX_PING_TO_REF" offset="0x18" width="32" description="">
		<bitfield id="TO_REF" width="32" begin="31" end="0" resetval="0x0" description="Ping Timer Reference Value. This is the 32-bit reference value for the ping timer. The timer will increment the counter starting from 0. When the reference value is reached, it will generate a timeout event, triggering a ping frame transmission. The counter will then reset to 0 and continue counting." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_PING_TO_CNT" acronym="CONTROLSS_FSI0_TX0_TX_PING_TO_CNT" offset="0x1C" width="32" description="">
		<bitfield id="TO_CNT" width="32" begin="31" end="0" resetval="0x0" description="Ping Timer Counter Value This register contains the current value of the ping timer counter. After reset, this counter will increment until it reaches the reference value (TX_PING_TO_REF), at which point it generates a ping frame transmission. After this point, the counter will reset to 0 and continue counting. This is a free-running counter" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_INT_CTRL" acronym="CONTROLSS_FSI0_TX0_TX_INT_CTRL" offset="0x20" width="16" description="">
		<bitfield id="INT2_EN_PING_TO" width="1" begin="11" end="11" resetval="0x0" description="Enable PING Timer Interrupt to INT2 This bit allows the event to generate an interrupt on the INT2 line.  0h (R/W) = This event will not trigger an interrupt on TX_INT2. 1h (R/W) = The ping timer event will trigger an interrupt on TX_INT2." range="11" rwaccess="RW"/> 
		<bitfield id="INT2_EN_BUF_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Enable Buffer Overrun Interrupt to INT2 This bit allows the event to generate an interrupt on the INT2 line.  0h (R/W) = This event will not trigger an interrupt on TX_INT2. 1h (R/W) = A Buffer Overrun condition will trigger an interrupt on TX_INT2." range="10" rwaccess="RW"/> 
		<bitfield id="INT2_EN_BUF_UNDERRUN" width="1" begin="9" end="9" resetval="0x0" description="Enable Buffer Underrun Interrupt to INT2 This bit allows the event to generate an interrupt on the INT2 line.  0h (R/W) = This event will not trigger an interrupt on TX_INT2. 1h (R/W) = A Buffer Underrun condition will trigger an interrupt on TX_INT2." range="9" rwaccess="RW"/> 
		<bitfield id="INT2_EN_FRAME_DONE" width="1" begin="8" end="8" resetval="0x0" description="Enable Frame Done interrupt to INT2 This bit allows the event to generate an interrupt on the INT2 line.  0h (R/W) = This event will not trigger an interrupt on TX_INT2. 1h (R/W) = A Frame Done event will trigger an interrupt on TX_INT2." range="8" rwaccess="RW"/> 
		<bitfield id="INT1_EN_PING_TO" width="1" begin="3" end="3" resetval="0x0" description="Enable Ping Timer Interrupt to INT1 This bit allows the event to generate an interrupt on the INT1 line.  0h (R/W) = This event will not trigger an interrupt on TX_INT1. 1h (R/W) = The ping timer event will trigger an interrupt on TX_INT1." range="3" rwaccess="RW"/> 
		<bitfield id="INT1_EN_BUF_OVERRUN" width="1" begin="2" end="2" resetval="0x0" description="Enable Buffer Overrun Interrupt to INT1 This bit allows the event to generate an interrupt on the INT1 line.  0h (R/W) = This event will not trigger an interrupt on TX_INT1. 1h (R/W) = A Buffer Overrun condition will trigger an interrupt on TX_INT1." range="2" rwaccess="RW"/> 
		<bitfield id="INT1_EN_BUF_UNDERRUN" width="1" begin="1" end="1" resetval="0x0" description="Enable Buffer Underrun Interrupt to INT1 This bit allows the event to generate an interrupt on the INT1 line.  0h (R/W) = This event will not trigger an interrupt on TX_INT1. 1h (R/W) = A Buffer Underrun condition will trigger an interrupt on TX_INT1." range="1" rwaccess="RW"/> 
		<bitfield id="INT1_EN_FRAME_DONE" width="1" begin="0" end="0" resetval="0x0" description="Enable Frame Done interrupt to INT1 This bit allows the event to generate an interrupt on the INT1 line.  0h (R/W) = This event will not trigger an interrupt on TX_INT1. 1h (R/W) = A Frame Done event will trigger an interrupt on TX_INT1." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_DMA_CTRL" acronym="CONTROLSS_FSI0_TX0_TX_DMA_CTRL" offset="0x22" width="16" description="">
		<bitfield id="DMA_EVT_EN" width="1" begin="0" end="0" resetval="0x0" description="DMA Event Enable bit This bit will enable the DMA event to be generated upon the completion of a transmit frame.  0h (R/W) = A DMA event will not be generated. 1h (R/W) = A DMA event will be generated upon the completion of a transmitted frame.   Note: The DMA event will only be generated for data frames." range="0" rwaccess="RW"/>
	</register>
