IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI0_TX0_CONTROLSS_FSI0_TX0.xml
	<register id="CONTROLSS_FSI0_TX0_TX_LOCK_CTRL" acronym="CONTROLSS_FSI0_TX0_TX_LOCK_CTRL" offset="0x24" width="16" description="">
		<bitfield id="KEY" width="8" begin="15" end="8" resetval="0x0" description="Write Key In order to write to this register, 0xA5 must be written to this field at the same time. Otherwise, writes are ignored. The key is cleared immediately after writing, so it must be written again for every change to this register." range="15 - 8" rwaccess="WO"/> 
		<bitfield id="LOCK" width="1" begin="0" end="0" resetval="0x0" description="Control Register Lock Enable bit This bit locks the contents of all the transmit control registers that support a lock protection. Once locked, further writes will not take effect until a SYSRS has reset this register. Once set, further writes to this bit will be ignored.  0h (R/W) = Transmit control registers can be modified and are not locked. 1h (R/W) = Transmit control registers are locked and cannot be modified until this bit is cleared by SYSRS. Any further writes to this bit are ignored.  Note: The KEY field must contatin 0xA5 for any write to this bit to take effect." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_EVT_STS" acronym="CONTROLSS_FSI0_TX0_TX_EVT_STS" offset="0x28" width="16" description="">
		<bitfield id="PING_TRIGGERED" width="1" begin="3" end="3" resetval="0x0" description="Ping Frame Triggered Flag Bit This bit indicates that a ping frame has been triggered. This bit is set by hardware when either the ping timer or an external trigger event have occured. Software can also force this bit to get set by writing to the TX_EVT_FRC register.   0h (R) = A ping frame has not been triggered. 1h (R) = A ping frame has been triggered by either the ping timer or external trigger.  To clear this bit, write to the corresponding bit in the TX_EVT_CLR register." range="3" rwaccess="RO"/> 
		<bitfield id="BUF_OVERRUN" width="1" begin="2" end="2" resetval="0x0" description="Buffer Overrun Flag Bit This bit inditcates that buffer overrun has occured.Software can also force this bit to get set by writing to the TX_EVT_FRC register.   0h (R) = Buffer Overrun has not occured. 1h (R) = Buffer Overrun has occured.  To clear this bit, write to the corresponding bit in the TX_EVT_CLR register." range="2" rwaccess="RO"/> 
		<bitfield id="BUF_UNDERRUN" width="1" begin="1" end="1" resetval="0x0" description="Buffer Underrun Flag Bit This bit inditcates that buffer underrun has occured.Software can also force this bit to get set by writing to the TX_EVT_FRC register.   0h (R) = Buffer Underrun has not occured. 1h (R) = Buffer Underrun has occured.  To clear this bit, write to the corresponding bit in the TX_EVT_CLR register." range="1" rwaccess="RO"/> 
		<bitfield id="FRAME_DONE" width="1" begin="0" end="0" resetval="0x0" description="Frame Done Flag Bit This bit inditcates a Frame Done condition. This bit is set by hardware when a frame transmission has been completed. Software can also force this bit to get set by writing to the TX_EVT_FRC register.   0h (R) = Frame Done condition has not occured. 1h (R) = Frame Done condition has occured.  To clear this bit, write to the corresponding bit in the TX_EVT_CLR register." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_EVT_CLR" acronym="CONTROLSS_FSI0_TX0_TX_EVT_CLR" offset="0x2C" width="16" description="">
		<bitfield id="PING_TRIGGERED" width="1" begin="3" end="3" resetval="0x0" description="Ping Frame Triggered Flag Clear bit This bit clears the corresponding bit in the TX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the TX_EVT_STS register to 0.  Note: This bit may not always be cleared when writing to the corresponding TX_EVT_CLR bit. If PING_TIMEOUT MODE is configured to be 0, a hardware ping timeout may occur when another frame is actively being transmitted. In this case, if this bit still shows as 1 after the clear bit is written then the ping frame has been triggered but not serviced. This bit does not indicate that the ping frame has been completely sent, only that it has been triggered by the timeout event." range="3" rwaccess="WO"/> 
		<bitfield id="BUF_OVERRUN" width="1" begin="2" end="2" resetval="0x0" description="Buffer Overrun Flag Clear bit This bit clears the corresponding bit in the TX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the TX_EVT_STS register to 0." range="2" rwaccess="WO"/> 
		<bitfield id="BUF_UNDERRUN" width="1" begin="1" end="1" resetval="0x0" description="Buffer Underrun Flag Clear bit This bit clears the corresponding bit in the TX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the TX_EVT_STS register to 0." range="1" rwaccess="WO"/> 
		<bitfield id="FRAME_DONE" width="1" begin="0" end="0" resetval="0x0" description="Frame Done Flag Clear bit This bit clears the corresponding bit in the TX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the TX_EVT_STS register to 0." range="0" rwaccess="WO"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_EVT_FRC" acronym="CONTROLSS_FSI0_TX0_TX_EVT_FRC" offset="0x2E" width="16" description="">
		<bitfield id="PING_TRIGGERED" width="1" begin="3" end="3" resetval="0x0" description="Ping Frame Triggered Flag Force bit This bit will cause the corresponding bit in the TX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding flag bit in the TX_EVT_STS Register." range="3" rwaccess="WO"/> 
		<bitfield id="BUF_OVERRUN" width="1" begin="2" end="2" resetval="0x0" description="Buffer Overrun Flag Force bit This bit will cause the corresponding bit in the TX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (R/W) = Writing a 0 to this bit will have no effect. 1h (R/W) = Force the corresponding flag bit in the TX_EVT_STS Register." range="2" rwaccess="WO"/> 
		<bitfield id="BUF_UNDERRUN" width="1" begin="1" end="1" resetval="0x0" description="Buffer Underrun Flag Force bit This bit will cause the corresponding bit in the TX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding flag bit in the TX_EVT_STS Register." range="1" rwaccess="WO"/> 
		<bitfield id="FRAME_DONE" width="1" begin="0" end="0" resetval="0x0" description="Frame Done Flag Force bit This bit will cause the corresponding bit in the TX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding flag bit in the TX_EVT_STS Register." range="0" rwaccess="WO"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_USER_CRC" acronym="CONTROLSS_FSI0_TX0_TX_USER_CRC" offset="0x30" width="16" description="">
		<bitfield id="USER_CRC" width="8" begin="7" end="0" resetval="0x0" description="User-defined CRC This register contains the 8-bit CRC value to be transmitted in the next frame if the transmission is set for  user-defined CRC option (TX_OPER_CTRL_LO.SW_CRC = 1). This register is ignored if the hardware CRC generation is enabled." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_ECC_DATA" acronym="CONTROLSS_FSI0_TX0_TX_ECC_DATA" offset="0x40" width="32" description="">
		<bitfield id="DATA_HIGH" width="16" begin="31" end="16" resetval="0x0" description="Upper 16 bits of ECC Data Writing to this bitfield will cause the ECC logic to compute the ECC(SEC-DED) the entire 32-bit register and update TX_ECC_VAL register with the results. Software should write to these 16 bits of the register in a 32-bit write when needing to compute ECC for 32-bits for the full TX_ECC_DATA register." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="DATA_LOW" width="16" begin="15" end="0" resetval="0x0" description="Lower 16 bits of ECC Data Writing to this bitfield will cause the ECC logic to compute the ECC(SEC-DED) for these 16 bits and update the TX_ECC_VAL register with the results. Software should write to these register bits as a 16-bit write when needing to compute ECC for 16-bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_ECC_VAL" acronym="CONTROLSS_FSI0_TX0_TX_ECC_VAL" offset="0x44" width="16" description="">
		<bitfield id="ECC_VAL" width="7" begin="6" end="0" resetval="0x12" description="Computed ECC Value This field contains the ECC value computed using SEC-DED either for 16-bit or 32-bit data in the TX_ECC_DATA register." range="6 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_DLYLINE_CTRL" acronym="CONTROLSS_FSI0_TX0_TX_DLYLINE_CTRL" offset="0x48" width="16" description="">
		<bitfield id="TXD1_DLY" width="5" begin="14" end="10" resetval="0x0" description="Delay Line Tap Select for TXD1 This bitfield selects the number of delay elements inserted into the TXD1 path from the pin boundary to the receiver core.  0h (R/W) Zero delay elements are included in the TXD1 path. TXD1 is taken directly from the pin. 1h (R/W) One delay element is included in the TXD1 path. 2h (R/W) Two delay elements are included in the TXD1 path. ... 1Fh (R/W) 31 delay elements are included in the TXD1 path, the maximum." range="14 - 10" rwaccess="RW"/> 
		<bitfield id="TXD0_DLY" width="5" begin="9" end="5" resetval="0x0" description="Delay Line Tap Select for TXD0 This bitfield selects the number of delay elements inserted into the TXD0 path from the pin boundary to the receiver core.  0h (R/W) Zero delay elements are included in the TXD0 path. TXD0 is taken directly from the pin. 1h (R/W) One delay element is included in the TXD0 path. 2h (R/W) Two delay elements are included in the TXD0 path. ... 1Fh (R/W) 31 delay elements are included in the TXD0 path, the maximum." range="9 - 5" rwaccess="RW"/> 
		<bitfield id="TXCLK_DLY" width="5" begin="4" end="0" resetval="0x0" description="Delay Line Tap Select for TXCLK This bitfield selects the number of delay elements inserted into the RXCLK path from the pin boundary to the receiver core.  0h (R/W) Zero delay elements are included in the TXCLK path. TXCLK is taken directly from the pin. 1h (R/W) One delay element is included in the TXCLK path. 2h (R/W) Two delay elements are included in the TXCLK path. ... 1Fh (R/W) 31 delay elements are included in the TXCLK path, the maximum." range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX0_TX_BUF_BASE" acronym="CONTROLSS_FSI0_TX0_TX_BUF_BASE" offset="0x80" width="16" description="">
		<bitfield id="BASE_ADDRESS" width="16" begin="15" end="0" resetval="0x0" description="Transmit Data Buffer Base Address This is the base address of the 16-word data buffer used by the transmitter." range="15 - 0" rwaccess="RW"/>
	</register>
</module>